/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "تطبيق NUIStyleSheet.";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "تطبيق SAP Mobile Services LogSettings.";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "فشلت المصادقة!";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "يتم الآن تحقق صلاحية بيانات الاعتماد.";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "هل تريد بالتأكيد إلغاء عملية إعداد الحساب؟";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "هل تريد بالتأكيد إلغاء عملية الاستعادة؟";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "هل تريد بالتأكيد إلغاء عملية إعادة تعيين رمز المرور؟";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "هل تريد بالتأكيد إلغاء عملية المصادقة؟";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "هل تريد بالتأكيد إعادة تعيين رمز المرور؟";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "هل تريد بالتأكيد إلغاء عملية تغيير رمز المرور؟";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "هل تريد بالتأكيد إعادة تعيين تطبيقك؟";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "الخطوات المركبة.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "يتم الآن تنزيل SAP Mobile Services ClientResources.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "يتم الآن تنزيل وجهات SAP Mobile Services.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "يتم الآن تنزيل إعدادات SAP Mobile Services.";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "متابعة";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "متابعة";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "تمكين";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "تمكين";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "يُرجى استخدام رمز المرور لتسجيل الدخول في المرة القادمة.";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "لن يتوفر Face ID بعد الآن";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "تغييرات السياسة";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "يُرجى استخدام رمز المرور لتسجيل الدخول في المرة القادمة.";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "لن يتوفر Touch ID بعد الآن";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "تغييرات السياسة";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "يمكنك تشغيل هذه الميزة أو إيقاف تشغيلها في أي وقت من الإعدادات.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Face ID متوفر الآن! يوفر لك تمكين Face ID وصولاً أسرع إلى معلوماتك.";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "Face ID";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "يمكنك تشغيل هذه الميزة أو إيقاف تشغيلها في أي وقت من الإعدادات.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Touch ID متوفر الآن! يوفر لك تمكين Touch ID وصولاً أسرع إلى معلوماتك.";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "Touch ID";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "متابعة";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "يُرجى إنشاء رمز مرور جديد.";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "تم تغيير سياسة رمز المرور";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "تغييرات السياسة";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "بدءًا من الآن، لن يعد رمز المرور وFace ID مطلوبين لتسجيل الدخول. \n\n ستدخل إلى التطبيق مباشرة.";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "بدءًا من الآن، لن يعد رمز المرور وTouch ID مطلوبين لتسجيل الدخول. \n\n ستدخل على التطبيق مباشرة.";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "موافق";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "بدءًا من الآن، لن يعد رمز المرور مطلوبًا لتسجيل الدخول. \n\n ستدخل على التطبيق مباشرة.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "تغيير سياسة تسجيل الدخول";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "الإخطار";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "متابعة";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "بدءًا من هذا الإصدار سيكون رمز المرور إلزاميًا. يُرجى إنشاء رمز مرور للتطبيق.";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "رمز المرور إلزامي";

/* XBUT: Text of No button. */
"noButtonText" = "لا";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "يتم الآن تحقق صحة بيانات اعتماد OAuth 2.0.";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "لتمكين Face ID، أدخل رمز المرور الخاص بك:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "لتمكين Touch ID، أدخل رمز المرور الخاص بك:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "دون الموافقة لن تصبح قادرًا على متابعة بدء التشغيل.";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "منح الموافقة";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "الخروج من العملية";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "يتم الآن تحقق صحة بيانات اعتماد SAML.";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "يتم الآن التحقق من صحة بيانات اعتماد اكتشاف هوية مستخدم SAP Mobile Services.";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "يتم الآن تحقق صحة بيانات اعتماد SLS.";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "يُرجى ملأ جميع الحقول";

/* XBUT: Text of Yes button. */
"yesButtonText" = "نعم";

/* XBUT: Text of Continue button. */
"continueButtonText" = "متابعة";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "إلغاء";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "مجموعة الاستخدام";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "يطلب مسؤول التطبيق أن تسمح بتجميع بيانات عنك باستخدام التطبيق لاكتساب رؤى لتحسين التطبيق. يتضمن تجميع البيانات معلومات حول كيفية استخدامك للتطبيق، مثل الوقت الذي تقضيه في استخدام التطبيق أو كيفية التنقل في التطبيق.";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "هل ترغب في إلغاء الاشتراك؟";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "هل ترغب في الاشتراك؟";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "تعطل مجموعة التقارير";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "يطلب مسؤول التطبيق أن تسمح بتجميع البيانات لتشخيص عمليات تعطل التطبيق وتحليلها لتحسين استقرار التطبيق. تقتصر البيانات التي يتم تجميعها على تقارير التعطل ومعلومات الجهاز.";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "فشل!";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "فشل التحقق من توقيع رمز QR!";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "تم التحقق من التوقيع الرقمي لرمز QR. سيتم الاتصال بـ:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "خطأ في المصادقة";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "نحن غير قادرين على مصادقة بياناتك. يُرجى تسجيل الدخول.";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "خطأ";

